{
  "home": "Ev",
  "about": "Hakkında",
  "education": "Eğitim",
  "project": "Projeler",
  "teachers": "Öğretmenler",
  "contact": "Temas etmek",

  "fron-End-developer": "Ön Uç geliştiricisiyim",
  "designer": "Tasarımcıyim",
  "self-Studier": "eysel Çalışmacıyım",
  "photographer": "fotoğrafçıyım",
  "hi": "Merhaba ben ",
  "a": "bir",
  "Rozita Yosufi": "Rozita Yosufi",

  "skills": "yetenek",
  "hobbie": "hobi",
  "myStory": "Benim hikayem",
  "iAm": "Ben",
  "about-p": " , CodeToInspire'da ön uç geliştirici ve tam yığın öğrencisiyim. Becerilerimi ve deneyimimi genişleten bir eğitim ve kişisel gelişim döneminin ardından iş bulmaya hevesliyim. Çoğunlukla seyahat etmeyi, yeni yemekler denemeyi ve farklı kültürlerle iç içe olmayı seviyorum. ",
  "resume": "Sürdürmek",

  "school": "Okul",
  "time-e": "Sunmak",
  "name-u": "Bilgisayar Bilimi",
  "name-sub": "web Geliştirme",
  "university": "Üniversite",
  "programing": "Programlama",
  "Source Code": "Kaynak kodu",
  "search": "Proje adını arayın...",

  "hobbies": {
    "Valleball": "Voleybol",
    "Coding": "Kodlama",
    "Reading": "Okuma",
    "Traveling": "Traveling",
    "Sport": "spor",
    "Photography": "fotoğrafçılık",
    "Cooking": "Yemek pişirmek",
    "Extra": "Ekstra"
  },

  "pro-des": "Bu proje öğrenme amacıyla tasarlanmış ve uygulanmıştır  ",

  "projects": {
    "Simon Game": "Simon Oyunu",
    "Footbal Team": "Futbol Takımı",
    "Dice Game": "Zar oyunu",
    "Simple Modal": "Basit Modal",
    "Number Guessing": "Sayı Tahmin Etme",
    "Pick Image": "Resim Seç",
    "Users List": "Kullanıcı Listesi",
    "Simple portfolio": "Basit portföy",
    "Shoping Item": "Alışveriş Öğesi",
    "Custom Select": "Özel Seçim",
    "Simple Site": "Basit Site",
    "CV": "Özgeçmiş",
    "Light & Dark": "Açık ve Koyu",
    "Calculator": "Hesap makinesi",
    "Parse Pak": "Parse pak",
    "Paint App": "Boya Uygulaması",
    "Profile": "Profil",
    "University Site": "Üniversite Sitesi",
    "UI/UX Design,Error Handling,Audio Integration,Game Logic,Timing and Animation ...": "UI/UX Tasarımı,Hata Yönetimi,Ses Entegrasyonu,Oyun Mantığı,Zamanlama ve Animasyon...",
    "how to work the project as a team, practicing the basic concepts of React ...": "Projede ekip olarak nasıl çalışılacağı, React'ın temel kavramlarının uygulanması ...",
    "Game Logic,Random Number Generation,DOM Manipulation,Project Organization...": "Oyun Mantığı, Rastgele Sayı Üretimi, DOM Manipülasyonu, Proje Organizasyonu...",
    "CSS Styling,Event-Driven Programming,Error Handling,Testing and Debugging...": "CSS Stili, Olay Odaklı Programlama, Hata İşleme, Test Etme ve Hata Ayıklama...",
    "User Input Handling,Random Number Generation,Game Logic,DOM Manipulation...": "Kullanıcı Giriş İşleme, Rastgele Sayı Üretimi, Oyun Mantığı, DOM Manipülasyonu...",
    "Component-Based Development,State Management,Testing and Debugging...": "Bileşen Tabanlı Geliştirme, Durum Yönetimi, Test ve Hata Ayıklama...",
    "State Management,Data Fetching,Handling User Interactions,Conditional Rendering...": "Durum Yönetimi,Veri Alma,Kullanıcı Etkileşimlerini Yönetme,Koşullu İşleme...",
    "Form Input Handling,Data Fetching,Handling User Interactions,Conditional Rendering...": "Form Girişini İşleme,Veri Alma,Kullanıcı Etkileşimlerini Yönetme,Koşullu İşleme...",
    "Semantic HTML, Responsive Design ,CSS Styling drop down...": "Anlamsal HTML, Duyarlı Tasarım, CSS Şekillendirme açılır menüsü...",
    "Semantic HTML,CSS Styling,Typography and Color,UI/UX Design,Linking and Navigation...": "Semantik HTML,CSS Şekillendirme,Tipografi ve Renk,UI/UX Tasarımı,Bağlama ve Gezinme...",
    "Semantic HTML,tables, lists,img ,Basic css styling properties ...": "Semantik HTML,tablolar, listeler,img,Temel css stil özellikleri...",
    "Flex box , display , flex-box properties , logic Navigation...": "Esnek kutu, ekran, esnek kutu özellikleri, mantık Gezinme...",
    "Input Handling,Data Fetching,Handling User Interactions,Conditional Rendering...": "Giriş İşleme,Veri Alma,Kullanıcı Etkileşimlerini İşleme,Koşullu İşleme...",
    "Semantic HTML,CSS Styling,Typography and Color,UI/UX Design...": "Anlamsal HTML, CSS Şekillendirme, Tipografi ve Renk, UI/UX Tasarımı...",
    "Semantic HTML,CSS Styling,Typography and Color,UI/UX Design,logic and Navigation...": "Anlamsal HTML, CSS Şekillendirme, Tipografi ve Renk, UI/UX Tasarımı, mantık ve Gezinme..."
  },

  "Whatthey": "Benim hakkımda",
  "sayAboutMe": "ne söylüyorlar",

  "teachersData": {
    "Rozita is a remarkable individual with a bright future ahead of her . Her dedication and hard work towards her studies are truly inspiring,I have seen her grow and develop into a confident and intelligent young woman. Her passion for learning is admirable, she always bring positivity and enthusiasm to classroom. also She is a hardworking and talented girl , she is sensitive and precise about what she reads and learns. her willingness to help others and her friendly demeanor make her a valuable member of my class .": "Rozita, önünde parlak bir geleceği olan dikkate değer bir bireydir. Çalışmalarına olan bağlılığı ve sıkı çalışması gerçekten ilham verici. Onun büyüyüp gelişerek kendine güvenen ve zeki bir genç kadına dönüştüğünü gördüm. Öğrenme tutkusu takdire şayandır; sınıfa her zaman pozitiflik ve coşku getirir. Ayrıca çalışkan ve yetenekli bir kızdır, okuduğu ve öğrendiği şeyler konusunda hassas ve titizdir. başkalarına yardım etme isteği ve arkadaş canlısı tavrı onu sınıfımın değerli bir üyesi yapıyor.",
    "Ms. Rozita is a hardworking student demonstrates an unwavering dedication and commitment that truly sets her apart. Her persistence and determination in tackling challenging tasks and exploring complex concepts are truly commendable. Not only does she exhibit a strong work ethic, but she also actively seek out opportunities for growth and consistently deliver exceptional results. Her willingness to go above and beyond showcases not just her diligence but also her passion for learning and achieving excellence. In group settings, she serve as an inspiring force, motivating others through her relentless pursuit of knowledge and her ability to overcome obstacles with grace and enthusiasm.": "Rozita, onu gerçekten farklı kılan sarsılmaz bir bağlılık ve bağlılık sergileyen çalışkan bir öğrencidir. Zorlu görevlerin üstesinden gelme ve karmaşık kavramları keşfetme konusundaki ısrarı ve kararlılığı gerçekten övgüye değerdir. Yalnızca güçlü bir çalışma ahlakı sergilemekle kalmıyor, aynı zamanda aktif olarak büyüme fırsatlarını arıyor ve sürekli olarak olağanüstü sonuçlar sunuyor. Üstüne ve ötesine geçme isteği, yalnızca çalışkanlığını değil aynı zamanda öğrenme ve mükemmelliğe ulaşma tutkusunu da sergiliyor. Grup ortamlarında, amansız bilgi arayışı ve engelleri zarafet ve coşkuyla aşma becerisiyle başkalarını motive ederek ilham verici bir güç olarak hizmet eder.",
    "Ms. Rozita Yosufi is one of the best colleagues I have ever worked with. She is a talented, creative and responsible programmer. Always looking for better and more advanced solutions for the projects we are involved in. Her performance in the programming team is highly commendable and we are happy to have her in our team.": "Bayan Rozita Yosufi şimdiye kadar birlikte çalıştığım en iyi meslektaşlarımdan biri. Yetenekli, yaratıcı ve sorumlu bir programcıdır. Yer aldığımız projelerde her zaman daha iyi ve daha gelişmiş çözümler arıyoruz. Programlama ekibindeki performansı son derece takdire şayan ve kendisini ekibimizde görmekten mutluluk duyuyoruz.",
    "Rozita is an exceptional student and an exceptional person. She has the potential to accomplish great things, and I have no doubt that she will make a difference in the world. I wish her all the best in her future endeavors and know that she will continue to inspire those around her with her dedication, hard work, and positive attitude.": "Rozita olağanüstü bir öğrenci ve olağanüstü bir insandır. Harika şeyler başarma potansiyeli var ve dünyada bir fark yaratacağından hiç şüphem yok. Kendisine bundan sonraki hayatında başarılar diliyor, özverisi, çalışkanlığı ve pozitif tavrıyla çevresindekilere ilham vermeye devam edeceğini biliyorum."
  },
  "contact-p": "Yazan: Rozita Yousufi Tüm Hakları Hak Edilmiştir.",
  "Email : rozitayousufi786@gmail.com": "E-posta : rozitayousufi786@gmail.com",
  "Phone : (93)744587407": "Telefon: (93)744587407",
  "My Education": "Eğitimim",
  "My Project": "Projem",
  "Teachers": "Öğretmenler",
  "Message Me": "Bana mesaj at",
  "Name": "İsim",
  "Email": "E-posta",
  "Message": "İleti",
  "Send": "Göndermek"
}
