{
  "home": "Heim",
  "about": "Um",
  "education": "Ausbildung",
  "project": "Projekte",
  "teachers": "Lehrer",
  "contact": "Kontakt",
  "Rozita Yosufi": "Rozita Yosufi",
  "fron-End-developer": "Entwicklerin",
  "designer": "Designerin",
  "self-Studier": "Selbststudium",
  "photographer": "Fotografin",
  "hi": "Hi , Ich bin",
  "a": "ein",

  "skills": "Fähigkeit",
  "hobbie": "Hobbys",
  "myStory": "Meine Geschichte",
  "iAm": "Ich bin",
  "about-p": " , ein Front-End-Entwickler und Full-Stack-Lernender im CodeToInspire-Institut. Nach einer Zeit der Ausbildung und persönlichen Weiterentwicklung, die meine Fähigkeiten und Erfahrungen erweitert hat, bin ich sehr daran interessiert, einen Job zu bekommen. Am liebsten reise ich, probiere neue Gerichte aus und tauche in andere Kulturen ein. ",
  "resume": "Lebenslauf",

  "school": "Schule",
  "time-e": "gegenwärtig",
  "name-u": "Informatik",
  "name-sub": "Web Entwicklung",
  "university": "Universität",
  "programing": "Programmierung",

  "Source Code": "Quell code",
  "search": "Projektname suchen...",

  "hobbies": {
    "Valleball": "Volleyball",
    "Coding": "Codierung",
    "Reading": "Lektüre",
    "Traveling": "Reisen",
    "Sport": "Sport",
    "Photography": "Fotografie",
    "Cooking": "Kochen",
    "Extra": "Extra"
  },

  "pro-des": "Dieses Projekt ist mit dem Ziel des Lernens konzipiert und umgesetzt ",

  "projects": {
    "Simon Game": "Simon-Spiel",
    "Footbal Team": "Fußballmannschaft",
    "Dice Game": "Würfelspiel",
    "Simple Modal": "Einfaches Modal",
    "Number Guessing": "Zahlen erraten",
    "Pick Image": "Wählen Sie Bild",
    "Users List": "Benutzerliste",
    "Simple portfolio": "Einfaches Portfolio",
    "Shoping Item": "Einkaufsartikel",
    "Custom Select": "Benutzerdefinierte Auswahl",
    "Simple Site": "Einfache Seite",
    "CV": "Lebenslauf",
    "Light & Dark": "Hell dunkel",
    "Calculator": "Taschenrechner",
    "Parse Pak": "Pak analysieren",
    "Paint App": "Paint-App",
    "Profile": "Profil",
    "University Site": "Website der Universität",
    "UI/UX Design,Error Handling,Audio Integration,Game Logic,Timing and Animation ...": "UI/UX-Design, Fehlerbehandlung, Audiointegration, Spiellogik, Timing und Animation ...",
    "how to work the project as a team, practicing the basic concepts of React ...": "wie man das Projekt im Team bearbeitet und die Grundkonzepte von React übt ...",
    "Game Logic,Random Number Generation,DOM Manipulation,Project Organization...": "Spiellogik, Zufallszahlengenerierung, DOM-Manipulation, Projektorganisation ...",
    "CSS Styling,Event-Driven Programming,Error Handling,Testing and Debugging...": "Spiellogik, Zufallszahlengenerierung, DOM-Manipulation, Projektorganisation ...",
    "User Input Handling,Random Number Generation,Game Logic,DOM Manipulation...": "Benutzereingabeverarbeitung, Zufallszahlengenerierung, Spiellogik, DOM-Manipulation ...",
    "Component-Based Development,State Management,Testing and Debugging,Project Organization...": "Komponentenbasierte Entwicklung, Zustandsverwaltung, Testen und Debuggen, Projektorganisation ...",
    "State Management,Data Fetching,Handling User Interactions,Conditional Rendering...": "State Management,Data Fetching,Handling User Interactions,Conditional Rendering...",
    "Form Input Handling,Data Fetching,Handling User Interactions,Conditional Rendering...": "Verarbeitung von Formulareingaben, Datenabruf, Handhabung von Benutzerinteraktionen, bedingtes Rendering ...",
    "Semantic HTML, Responsive Design ,CSS Styling drop down...": "Semantisches HTML, responsives Design, CSS-Dropdown-Stil ...",
    "Semantic HTML,CSS Styling,Typography and Color,UI/UX Design,Linking and Navigation...": "Semantisches HTML, CSS-Styling, Typografie und Farbe, UI/UX-Design, Verknüpfung und Navigation ...",
    "Semantic HTML,tables, lists,img ,Basic css styling properties ...": "Semantisches HTML, Tabellen, Listen, IMG, grundlegende CSS-Stileigenschaften ...",
    "Flex box , display , flex-box properties , logic Navigation...": "Flex-Box, Anzeige, Flex-Box-Eigenschaften, Logiknavigation ...",
    "Input Handling,Data Fetching,Handling User Interactions,Conditional Rendering...": "Eingabeverarbeitung, Datenabruf, Verarbeitung von Benutzerinteraktionen, bedingtes Rendering ...",
    "Semantic HTML,CSS Styling,Typography and Color,UI/UX Design...": "Semantisches HTML, CSS-Stil, Typografie und Farbe, UI/UX-Design ...",
    "Semantic HTML,CSS Styling,Typography and Color,UI/UX Design,logic and Navigation...": "Semantisches HTML, CSS-Stil, Typografie und Farbe, UI/UX-Design, Logik und Navigation ..."
  },

  "Whatthey": "Was sie",
  "sayAboutMe": "über mich sagen",
  "teachersData": {
    "Rozita is a remarkable individual with a bright future ahead of her . Her dedication and hard work towards her studies are truly inspiring,I have seen her grow and develop into a confident and intelligent young woman. Her passion for learning is admirable, she always bring positivity and enthusiasm to classroom. also She is a hardworking and talented girl , she is sensitive and precise about what she reads and learns. her willingness to help others and her friendly demeanor make her a valuable member of my class .": "Rozita ist eine bemerkenswerte Persönlichkeit mit einer glänzenden Zukunft vor sich. Ihr Engagement und ihre harte Arbeit für ihr Studium sind wirklich inspirierend. Ich habe gesehen, wie sie heranwuchs und sich zu einer selbstbewussten und intelligenten jungen Frau entwickelte. Ihre Leidenschaft fürs Lernen ist bewundernswert, sie bringt immer positive Stimmung und Begeisterung in den Unterricht. Außerdem ist sie ein fleißiges und talentiertes Mädchen, sie ist einfühlsam und präzise in dem, was sie liest und lernt. Ihre Hilfsbereitschaft und ihr freundliches Auftreten machen sie zu einem wertvollen Mitglied meiner Klasse.",
    "Ms. Rozita is a hardworking student demonstrates an unwavering dedication and commitment that truly sets her apart. Her persistence and determination in tackling challenging tasks and exploring complex concepts are truly commendable. Not only does she exhibit a strong work ethic, but she also actively seek out opportunities for growth and consistently deliver exceptional results. Her willingness to go above and beyond showcases not just her diligence but also her passion for learning and achieving excellence. In group settings, she serve as an inspiring force, motivating others through her relentless pursuit of knowledge and her ability to overcome obstacles with grace and enthusiasm.": "Rozita ist eine fleißige Studentin und zeigt eine unerschütterliche Hingabe und Hingabe, die sie wirklich auszeichnet. Ihre Beharrlichkeit und Entschlossenheit bei der Bewältigung anspruchsvoller Aufgaben und der Erforschung komplexer Konzepte sind wirklich lobenswert. Sie zeichnet sich nicht nur durch eine ausgeprägte Arbeitsmoral aus, sondern sucht auch aktiv nach Wachstumschancen und liefert stets außergewöhnliche Ergebnisse. Ihre Bereitschaft, über sich hinauszuwachsen, zeigt nicht nur ihren Fleiß, sondern auch ihre Leidenschaft für das Lernen und das Erzielen von Spitzenleistungen. In Gruppen wirkt sie als inspirierende Kraft und motiviert andere durch ihr unermüdliches Streben nach Wissen und ihre Fähigkeit, Hindernisse mit Anmut und Begeisterung zu überwinden.",
    "Ms. Rozita Yosufi is one of the best colleagues I have ever worked with. She is a talented, creative and responsible programmer. Always looking for better and more advanced solutions for the projects we are involved in. Her performance in the programming team is highly commendable and we are happy to have her in our team.": "Frau Rozita Yosufi ist eine der besten Kolleginnen, mit denen ich je zusammengearbeitet habe. Sie ist eine talentierte, kreative und verantwortungsbewusste Programmiererin. Stets auf der Suche nach besseren und fortschrittlicheren Lösungen für die Projekte, an denen wir beteiligt sind. Ihre Leistung im Programmierteam ist sehr lobenswert und wir freuen uns, sie in unserem Team zu haben.",
    "Rozita is an exceptional student and an exceptional person. She has the potential to accomplish great things, and I have no doubt that she will make a difference in the world. I wish her all the best in her future endeavors and know that she will continue to inspire those around her with her dedication, hard work, and positive attitude.": "Rozita ist eine außergewöhnliche Schülerin und ein außergewöhnlicher Mensch. Sie hat das Potenzial, Großes zu leisten, und ich habe keinen Zweifel daran, dass sie einen Unterschied in der Welt machen wird. Ich wünsche ihr alles Gute für ihre zukünftigen Aufgaben und weiß, dass sie die Menschen um sie herum weiterhin mit ihrem Engagement, ihrer harten Arbeit und ihrer positiven Einstellung inspirieren wird."
  },
  "contact-p": " von Rozita Yousufi Alle Rechte verdient.",
  "Email : rozitayousufi786@gmail.com": "Email : rozitayousufi786@gmail.com",
  "Phone : (93)744587407": "Telefon : (93)744587407",
  "My Education": "Meine Bildung",
  "My Project": "Mein Projekt",
  "Teachers": "Lehrer",
  "Message Me": "Nachricht",
  "Name": "Name",
  "Email": "Email",
  "Message": "Schick mir eine Nachricht",
  "Send": "Schicken"
}
